ОБРАБОТКА МАТРИЦЫ ЦЕЛЫХ ЧИСЕЛ:
1-ввод данных с клавиатуры
2-генерирование чисел
3-записать матрицу в файл
4-восстановить матрицу из файла
5-минимальные элементы в строках матрицы
6-максимальные элементы в строках матрицы
7-минимальные элементы в столбцах матрицы
8-максимальные элементы в столбцах матрицы
9-минимальный элемент матрицы
10-максимальный элемент матрицы
11-суммы элементов по строкам матрицы
12-суммы элементов по столбцам матрицы
13-сумма всех элементов матрицы
14-сортировка по возрастанию элементов строк матрицы
15-сортировка по убыванию элементов строк матрицы
16-сортировка по возрастанию элементов столбцов матрицы
17-сортировка по убыванию элементов столбцов матрицы
18-транспонирование матрицы, если strok=stolb
19-перейти к обработке другой матрицы
20-завершить программу

Введите количество строк из[1 - 50] и столбцов из[1 - 20] матрицы:
Строк=5
Столбцов=5
Ввод данных с клавиатуры(1) или генерирование(2)? 2
Сформирована матрица размером 5x5:
  27  18  98   9  64
  78  66  29  44   3
  70  36  79   0  37
  47   7  85   4  53
  56  43  65  97  11


Введите операцию обработки матрицы из набора [3-20]: 1


Введите операцию обработки матрицы из набора [3-20]: 2


Введите операцию обработки матрицы из набора [3-20]: 3
Запись матрицы объекта в файл outMFBin.d
Запись матрицы объекта в файл outMFBil.d
Запись матрицы объекта в файл outMFTxt.d


Введите операцию обработки матрицы из набора [3-20]: 4
Чтение матрицы объекта из файла outMFBin.d
  27  18  98   9  64
  78  66  29  44   3
  70  36  79   0  37
  47   7  85   4  53
  56  43  65  97  11
Чтение матрицы объекта из файла outMFBil.d
  27  18  98   9  64
  78  66  29  44   3
  70  36  79   0  37
  47   7  85   4  53
  56  43  65  97  11
Чтение матрицы объекта из файла outMFTxt.d
  27  18  98   9  64
  78  66  29  44   3
  70  36  79   0  37
  47   7  85   4  53
  56  43  65  97  11


Введите операцию обработки матрицы из набора [3-20]: 5

Минимальные элементы в строках матрицы:		9	3	0	4	11	

Введите операцию обработки матрицы из набора [3-20]: 6

Максимальные элементы в строках матрицы:	98	78	79	85	97	

Введите операцию обработки матрицы из набора [3-20]: 7

Минимальные элементы в столбцах матрицы:		27	7	29	0	3	

Введите операцию обработки матрицы из набора [3-20]: 8

Максимальные элементы в столбцах матрицы:	78	66	98	97	64	

Введите операцию обработки матрицы из набора [3-20]: 9

Mинимальный элемент матрицы:	0

Введите операцию обработки матрицы из набора [3-20]: 0


Введите операцию обработки матрицы из набора [3-20]: 10

Максимальный элемент матрицы:	98

Введите операцию обработки матрицы из набора [3-20]: 11

Cуммa элементов по строкам матрицы	216	220	222	196	272	

Введите операцию обработки матрицы из набора [3-20]: 12

Cуммa элементов по столбцам матрицы	278	170	356	154	168	

Введите операцию обработки матрицы из набора [3-20]: 13

Cуммa элементов матрицы	1126

Введите операцию обработки матрицы из набора [3-20]: 14
Элементы строк матрицы по возрастанию:
   9  18  27  64  98
   3  29  44  66  78
   0  36  37  70  79
   4   7  47  53  85
  11  43  56  65  97


Введите операцию обработки матрицы из набора [3-20]: 15
Элементы строк матрицы по убыванию:
  98  64  27  18   9
  78  66  44  29   3
  79  70  37  36   0
  85  53  47   7   4
  97  65  56  43  11


Введите операцию обработки матрицы из набора [3-20]: 16
Элементы столбцов матрицы по возрастанию:
  78  53  27   7   0
  79  64  37  18   3
  85  65  44  29   4
  97  66  47  36   9
  98  70  56  43  11


Введите операцию обработки матрицы из набора [3-20]: 17
Элементы столбцов матрицы по убыванию:
  98  70  56  43  11
  97  66  47  36   9
  85  65  44  29   4
  79  64  37  18   3
  78  53  27   7   0


Введите операцию обработки матрицы из набора [3-20]: 18
  98  97  85  79  78
  70  66  65  64  53
  56  47  44  37  27
  43  36  29  18   7
  11   9   4   3   0


Введите операцию обработки матрицы из набора [3-20]: 19
ОБРАБОТКА МАТРИЦЫ ЦЕЛЫХ ЧИСЕЛ:
1-ввод данных с клавиатуры
2-генерирование чисел
3-записать матрицу в файл
4-восстановить матрицу из файла
5-минимальные элементы в строках матрицы
6-максимальные элементы в строках матрицы
7-минимальные элементы в столбцах матрицы
8-максимальные элементы в столбцах матрицы
9-минимальный элемент матрицы
10-максимальный элемент матрицы
11-суммы элементов по строкам матрицы
12-суммы элементов по столбцам матрицы
13-сумма всех элементов матрицы
14-сортировка по возрастанию элементов строк матрицы
15-сортировка по убыванию элементов строк матрицы
16-сортировка по возрастанию элементов столбцов матрицы
17-сортировка по убыванию элементов столбцов матрицы
18-транспонирование матрицы, если strok=stolb
19-перейти к обработке другой матрицы
20-завершить программу

Введите количество строк из[1 - 50] и столбцов из[1 - 20] матрицы:
Строк=20
Столбцов=20
Ввод данных с клавиатуры(1) или генерирование(2)? 20
Сформирована матрица размером 20x20:
  93  99  67  22  51  33  61  10  67  64  27  82  50  95  26  54  68   0  67  95
  22  39  57  94  99   8  25  16   8  66  93  78  44  50  22  23  72   3  29  10
  28  51  83  26  18  19  24  69  14  70  73  68   6   8  61  57  83  56  39  97
  61  66  40  52  23  42  62  50  81  69   0  83  69  75  40  54  37  64  66  29
  56  83  86   8   6  51   9   0  36   4  72   2  63  91  36  20  37  21  92  59
  71  45  77  99   0  30  56  78  97  86  14  11  60  18  48   6  71  50   7  91
  15   9  44  96  76   8  93   2  18   6  65  80  76  16  42  22  57  70  79  20
  68  38  62  47  28   6  92  94  24  56  99  21  67  42  61  18  75  91  95   6
  63   5  18  50  46  63  69  73  70  89  75  37  62  70  15  56  83  97  66  17
  69  17   3  39   8  94  18  49  13   7  61  34  95   6  82  80  73   0  11  27
  33  69  30  64   1   4   9  18  14  18  41  19  23  45  65  16  43  35  26   9
  84  56  12  77  30  45  36  20  27   9  20  90   1  69  18   6  59  54  52  39
  36  17  75  23   8  20  43  85  75  84  50  25  99  39   9  49  84  10  79  30
  90  65  15  47  23  69  61  82  80  38  20   8  25  50  42  58  66  54  91  65
  32  77  10  66  43  54  78  90  30   1  64  43  58  15  58  20  42  61   7  10
  90   3  92  48  21  66   7  27  45  92  69   1   6  98  78   7  82  98  19  30
   3  38  31  99  65   1  75  13  62  21  54  86  95  28  21  29  25  51  86   7
  72  40  11  61  18  79  45  65  91   3  34  22   4  17  40  77  65  34  99  90
  88  73  89  83  74  63  59  19  28  82  46  50  19  43  80  36  47  72  57  63
  90  98  93  45  19  91   2  66  49  86  98   5  42  25  79  77  88  51  62  75


Введите операцию обработки матрицы из набора [3-20]: 20
